docs/dplyr.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-04 Tue 18:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dplyr Examples</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Demo of some of my most used dplyr features.@EOL"
 />
<meta name="keywords" content="package cran dplyr R" />











</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/ex-R/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">dplyr Examples</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-05-04 18:15:26</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2020-2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5c658bc">1. Source Code and Files</a></li>
<li><a href="#orgf94e822">2. First Steps</a>
<ul>
<li><a href="#org0e2806a">2.1. Load the library</a></li>
<li><a href="#org46d8027">2.2. Example Data</a></li>
<li><a href="#org1584a2d">2.3. Row Names</a></li>
</ul>
</li>
<li><a href="#org9f81bd3">3. Selecting Rows</a>
<ul>
<li><a href="#org5e2788d">3.1. With a boolean expression</a></li>
<li><a href="#orgc0f7e43">3.2. With an index</a></li>
<li><a href="#orgd6ab2b1">3.3. Pull out a sample row for each distinct record</a></li>
</ul>
</li>
<li><a href="#org4e7ecf1">4. Sorting</a></li>
<li><a href="#org35a477a">5. Selecting Columns</a>
<ul>
<li><a href="#org74149f1">5.1. With a range</a></li>
<li><a href="#org1f4e4e2">5.2. Select and rename</a></li>
<li><a href="#orgb5a85bf">5.3. Just rename (but keep other columns)</a></li>
</ul>
</li>
<li><a href="#org1d99875">6. New columns</a>
<ul>
<li><a href="#org45387cc">6.1. Compute new columns based on other columns</a></li>
<li><a href="#orgc4a768c">6.2. Compute new columns based on other columns and throw away all the old columns</a></li>
</ul>
</li>
<li><a href="#orge5b3130">7. Aggregation</a>
<ul>
<li><a href="#orgd4c2ff6">7.1. Global Aggregation</a></li>
<li><a href="#org88d5857">7.2. Aggregate by factor level</a></li>
<li><a href="#orgff6cd3f">7.3. Aggregate by multiple factors</a></li>
<li><a href="#orgb548ba6">7.4. Summarize by group and put results back in data frame</a></li>
</ul>
</li>
<li><a href="#orgd2c2b2f">8. Join</a>
<ul>
<li><a href="#org6ff735f">8.1. Example Data For Joins</a></li>
<li><a href="#orgb1710b0">8.2. Inner Join</a></li>
<li><a href="#orgdda5297">8.3. Left Join</a></li>
<li><a href="#org576b107">8.4. Right Join</a></li>
<li><a href="#org266ca97">8.5. full outer Join</a></li>
<li><a href="#org423206d">8.6. Find left matches</a></li>
<li><a href="#orgca6d781">8.7. Fixing column names</a></li>
</ul>
</li>
<li><a href="#org71c7299">9. Chaining vs Nesting</a>
<ul>
<li><a href="#org0416d3a">9.1. Chaining</a></li>
<li><a href="#orge8d452e">9.2. Temporary Variables</a></li>
<li><a href="#orgaa93d0f">9.3. Composition (for the LISPers)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5c658bc" class="outline-2">
<h2 id="org5c658bc"><span class="section-number-2">1</span> Source Code and Files</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="dplyr.org">dplyr.org</a></li>
<li><a href="dplyr.R">dplyr.R</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf94e822" class="outline-2">
<h2 id="orgf94e822"><span class="section-number-2">2</span> First Steps</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0e2806a" class="outline-3">
<h3 id="org0e2806a"><span class="section-number-3">2.1</span> Load the library</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #8470ff; font-weight: bold;">library</span>(dplyr)
</pre>
</div>
</div>
</div>
