docs/dplyr.html

<div id="outline-container-org46d8027" class="outline-3">
<h3 id="org46d8027"><span class="section-number-3">2.2</span> Example Data</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-R">mtcars
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">                     mpg cyl  disp  hp drat    wt  qsec vs am gear carb
Mazda RX4           21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4
Mazda RX4 Wag       21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4
Datsun 710          22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1
Hornet 4 Drive      21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1
Hornet Sportabout   18.7   8 360.0 175 3.15 3.440 17.02  0  0    3    2
Valiant             18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1
Duster 360          14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4
Merc 240D           24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2
Merc 230            22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2
Merc 280            19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4
Merc 280C           17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4
Merc 450SE          16.4   8 275.8 180 3.07 4.070 17.40  0  0    3    3
Merc 450SL          17.3   8 275.8 180 3.07 3.730 17.60  0  0    3    3
Merc 450SLC         15.2   8 275.8 180 3.07 3.780 18.00  0  0    3    3
Cadillac Fleetwood  10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4
Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4
Chrysler Imperial   14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4
Fiat 128            32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1
Honda Civic         30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2
Toyota Corolla      33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1
Toyota Corona       21.5   4 120.1  97 3.70 2.465 20.01  1  0    3    1
Dodge Challenger    15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    2
AMC Javelin         15.2   8 304.0 150 3.15 3.435 17.30  0  0    3    2
Camaro Z28          13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4
Pontiac Firebird    19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    2
Fiat X1-9           27.3   4  79.0  66 4.08 1.935 18.90  1  1    4    1
Porsche 914-2       26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2
Lotus Europa        30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2
Ford Pantera L      15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4
Ferrari Dino        19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6
Maserati Bora       15.0   8 301.0 335 3.54 3.570 14.60  0  1    5    8
Volvo 142E          21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2
</pre>
</div>
</div>
</div>

<div id="outline-container-org1584a2d" class="outline-3">
<h3 id="org1584a2d"><span class="section-number-3">2.3</span> Row Names</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-R">mtcarsR <span style="color: #8470ff; font-weight: bold;">&lt;-</span> tibble::rownames_to_column(mtcars, <span style="color: #fa8072;">'car_name'</span>)                         
mtcarsR
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">              car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb
1            Mazda RX4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4
2        Mazda RX4 Wag 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4
3           Datsun 710 22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1
4       Hornet 4 Drive 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1
5    Hornet Sportabout 18.7   8 360.0 175 3.15 3.440 17.02  0  0    3    2
6              Valiant 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1
7           Duster 360 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4
8            Merc 240D 24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2
9             Merc 230 22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2
10            Merc 280 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4
11           Merc 280C 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4
12          Merc 450SE 16.4   8 275.8 180 3.07 4.070 17.40  0  0    3    3
13          Merc 450SL 17.3   8 275.8 180 3.07 3.730 17.60  0  0    3    3
14         Merc 450SLC 15.2   8 275.8 180 3.07 3.780 18.00  0  0    3    3
15  Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4
16 Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4
17   Chrysler Imperial 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4
18            Fiat 128 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1
19         Honda Civic 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2
20      Toyota Corolla 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1
21       Toyota Corona 21.5   4 120.1  97 3.70 2.465 20.01  1  0    3    1
22    Dodge Challenger 15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    2
23         AMC Javelin 15.2   8 304.0 150 3.15 3.435 17.30  0  0    3    2
24          Camaro Z28 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4
25    Pontiac Firebird 19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    2
26           Fiat X1-9 27.3   4  79.0  66 4.08 1.935 18.90  1  1    4    1
27       Porsche 914-2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2
28        Lotus Europa 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2
29      Ford Pantera L 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4
30        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6
31       Maserati Bora 15.0   8 301.0 335 3.54 3.570 14.60  0  1    5    8
32          Volvo 142E 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9f81bd3" class="outline-2">
<h2 id="org9f81bd3"><span class="section-number-2">3</span> Selecting Rows</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5e2788d" class="outline-3">
<h3 id="org5e2788d"><span class="section-number-3">3.1</span> With a boolean expression</h3>
<div class="outline-text-3" id="text-3-1">
<p>
You can actually replace that &amp; with a comma, but I'm usually explicit about this sort of thing
</p>

<div class="org-src-container">
<pre class="src src-R">dplyr::filter(mtcarsR, cyl&gt;4 &amp; carb==4)                        
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">              car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb
1            Mazda RX4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4
2        Mazda RX4 Wag 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4
3           Duster 360 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4
4             Merc 280 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4
5            Merc 280C 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4
6   Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4
7  Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4
8    Chrysler Imperial 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4
9           Camaro Z28 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4
10      Ford Pantera L 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0f7e43" class="outline-3">
<h3 id="orgc0f7e43"><span class="section-number-3">3.2</span> With an index</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-R">dplyr::slice(mtcarsR, 15:20)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">             car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb
1  Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4
2 Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4
3   Chrysler Imperial 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4
4            Fiat 128 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1
5         Honda Civic 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2
6      Toyota Corolla 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6ab2b1" class="outline-3">
<h3 id="orgd6ab2b1"><span class="section-number-3">3.3</span> Pull out a sample row for each distinct record</h3>
<div class="outline-text-3" id="text-3-3">
<p>
More useful if <code>dplyr::select</code> is used to limit input to the column(s)
</p>

<div class="org-src-container">
<pre class="src src-R">dplyr::distinct(mtcarsR, cyl, carb)           
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">  cyl carb
1   6    4
2   4    1
3   6    1
4   8    2
5   8    4
6   4    2
7   8    3
8   6    6
9   8    8
</pre>
</div>
</div>
</div>
</div>
