docs/dplyr.html

<div id="outline-container-org4e7ecf1" class="outline-2">
<h2 id="org4e7ecf1"><span class="section-number-2">4</span> Sorting</h2>
<div class="outline-text-2" id="text-4">
<p>
Could have used '-gear' here as 'gear' is numeric, but 'desc' works on strings as well.
</p>

<div class="org-src-container">
<pre class="src src-R">dplyr::arrange(mtcarsR, cyl, desc(gear)) 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">              car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb
1        Porsche 914-2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2
2         Lotus Europa 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2
3           Datsun 710 22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1
4            Merc 240D 24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2
5             Merc 230 22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2
6             Fiat 128 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1
7          Honda Civic 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2
8       Toyota Corolla 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1
9            Fiat X1-9 27.3   4  79.0  66 4.08 1.935 18.90  1  1    4    1
10          Volvo 142E 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2
11       Toyota Corona 21.5   4 120.1  97 3.70 2.465 20.01  1  0    3    1
12        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6
13           Mazda RX4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4
14       Mazda RX4 Wag 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4
15            Merc 280 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4
16           Merc 280C 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4
17      Hornet 4 Drive 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1
18             Valiant 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1
19      Ford Pantera L 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4
20       Maserati Bora 15.0   8 301.0 335 3.54 3.570 14.60  0  1    5    8
21   Hornet Sportabout 18.7   8 360.0 175 3.15 3.440 17.02  0  0    3    2
22          Duster 360 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4
23          Merc 450SE 16.4   8 275.8 180 3.07 4.070 17.40  0  0    3    3
24          Merc 450SL 17.3   8 275.8 180 3.07 3.730 17.60  0  0    3    3
25         Merc 450SLC 15.2   8 275.8 180 3.07 3.780 18.00  0  0    3    3
26  Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4
27 Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4
28   Chrysler Imperial 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4
29    Dodge Challenger 15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    2
30         AMC Javelin 15.2   8 304.0 150 3.15 3.435 17.30  0  0    3    2
31          Camaro Z28 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4
32    Pontiac Firebird 19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    2
</pre>
</div>
</div>
</div>

<div id="outline-container-org35a477a" class="outline-2">
<h2 id="org35a477a"><span class="section-number-2">5</span> Selecting Columns</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org74149f1" class="outline-3">
<h3 id="org74149f1"><span class="section-number-3">5.1</span> With a range</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Love how you can use column names with the range operator.  Numbers work too, but that is boring.
</p>

<div class="org-src-container">
<pre class="src src-R">dplyr::select(mtcarsR, cyl:drat)         
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">   cyl  disp  hp drat
1    6 160.0 110 3.90
2    6 160.0 110 3.90
3    4 108.0  93 3.85
4    6 258.0 110 3.08
5    8 360.0 175 3.15
6    6 225.0 105 2.76
7    8 360.0 245 3.21
8    4 146.7  62 3.69
9    4 140.8  95 3.92
10   6 167.6 123 3.92
11   6 167.6 123 3.92
12   8 275.8 180 3.07
13   8 275.8 180 3.07
14   8 275.8 180 3.07
15   8 472.0 205 2.93
16   8 460.0 215 3.00
17   8 440.0 230 3.23
18   4  78.7  66 4.08
19   4  75.7  52 4.93
20   4  71.1  65 4.22
21   4 120.1  97 3.70
22   8 318.0 150 2.76
23   8 304.0 150 3.15
24   8 350.0 245 3.73
25   8 400.0 175 3.08
26   4  79.0  66 4.08
27   4 120.3  91 4.43
28   4  95.1 113 3.77
29   8 351.0 264 4.22
30   6 145.0 175 3.62
31   8 301.0 335 3.54
32   4 121.0 109 4.11
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f4e4e2" class="outline-3">
<h3 id="org1f4e4e2"><span class="section-number-3">5.2</span> Select and rename</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-R">dplyr::select(mtcarsR, displacement=disp, cyl)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">   displacement cyl
1         160.0   6
2         160.0   6
3         108.0   4
4         258.0   6
5         360.0   8
6         225.0   6
7         360.0   8
8         146.7   4
9         140.8   4
10        167.6   6
11        167.6   6
12        275.8   8
13        275.8   8
14        275.8   8
15        472.0   8
16        460.0   8
17        440.0   8
18         78.7   4
19         75.7   4
20         71.1   4
21        120.1   4
22        318.0   8
23        304.0   8
24        350.0   8
25        400.0   8
26         79.0   4
27        120.3   4
28         95.1   4
29        351.0   8
30        145.0   6
31        301.0   8
32        121.0   4
</pre>
</div>
</div>
</div>
