src/dplyr.org
** Just rename (but keep other columns)

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dplyr.R" :wrap "src text :eval never :tangle no"
dplyr::rename(mtcarsR, displacement=disp, weight=wt)
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
              car_name  mpg cyl displacement  hp drat weight  qsec vs am gear carb
1            Mazda RX4 21.0   6        160.0 110 3.90  2.620 16.46  0  1    4    4
2        Mazda RX4 Wag 21.0   6        160.0 110 3.90  2.875 17.02  0  1    4    4
3           Datsun 710 22.8   4        108.0  93 3.85  2.320 18.61  1  1    4    1
4       Hornet 4 Drive 21.4   6        258.0 110 3.08  3.215 19.44  1  0    3    1
5    Hornet Sportabout 18.7   8        360.0 175 3.15  3.440 17.02  0  0    3    2
6              Valiant 18.1   6        225.0 105 2.76  3.460 20.22  1  0    3    1
7           Duster 360 14.3   8        360.0 245 3.21  3.570 15.84  0  0    3    4
8            Merc 240D 24.4   4        146.7  62 3.69  3.190 20.00  1  0    4    2
9             Merc 230 22.8   4        140.8  95 3.92  3.150 22.90  1  0    4    2
10            Merc 280 19.2   6        167.6 123 3.92  3.440 18.30  1  0    4    4
11           Merc 280C 17.8   6        167.6 123 3.92  3.440 18.90  1  0    4    4
12          Merc 450SE 16.4   8        275.8 180 3.07  4.070 17.40  0  0    3    3
13          Merc 450SL 17.3   8        275.8 180 3.07  3.730 17.60  0  0    3    3
14         Merc 450SLC 15.2   8        275.8 180 3.07  3.780 18.00  0  0    3    3
15  Cadillac Fleetwood 10.4   8        472.0 205 2.93  5.250 17.98  0  0    3    4
16 Lincoln Continental 10.4   8        460.0 215 3.00  5.424 17.82  0  0    3    4
17   Chrysler Imperial 14.7   8        440.0 230 3.23  5.345 17.42  0  0    3    4
18            Fiat 128 32.4   4         78.7  66 4.08  2.200 19.47  1  1    4    1
19         Honda Civic 30.4   4         75.7  52 4.93  1.615 18.52  1  1    4    2
20      Toyota Corolla 33.9   4         71.1  65 4.22  1.835 19.90  1  1    4    1
21       Toyota Corona 21.5   4        120.1  97 3.70  2.465 20.01  1  0    3    1
22    Dodge Challenger 15.5   8        318.0 150 2.76  3.520 16.87  0  0    3    2
23         AMC Javelin 15.2   8        304.0 150 3.15  3.435 17.30  0  0    3    2
24          Camaro Z28 13.3   8        350.0 245 3.73  3.840 15.41  0  0    3    4
25    Pontiac Firebird 19.2   8        400.0 175 3.08  3.845 17.05  0  0    3    2
26           Fiat X1-9 27.3   4         79.0  66 4.08  1.935 18.90  1  1    4    1
27       Porsche 914-2 26.0   4        120.3  91 4.43  2.140 16.70  0  1    5    2
28        Lotus Europa 30.4   4         95.1 113 3.77  1.513 16.90  1  1    5    2
29      Ford Pantera L 15.8   8        351.0 264 4.22  3.170 14.50  0  1    5    4
30        Ferrari Dino 19.7   6        145.0 175 3.62  2.770 15.50  0  1    5    6
31       Maserati Bora 15.0   8        301.0 335 3.54  3.570 14.60  0  1    5    8
32          Volvo 142E 21.4   4        121.0 109 4.11  2.780 18.60  1  1    4    2
#+end_src

* New columns

** Compute new columns based on other columns

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dplyr.R" :wrap "src text :eval never :tangle no"
dplyr::mutate(mtcarsR, mpc=mpg/cyl, impc=1/mpc) 
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
              car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb      mpc      impc
1            Mazda RX4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4 3.500000 0.2857143
2        Mazda RX4 Wag 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4 3.500000 0.2857143
3           Datsun 710 22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1 5.700000 0.1754386
4       Hornet 4 Drive 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1 3.566667 0.2803738
5    Hornet Sportabout 18.7   8 360.0 175 3.15 3.440 17.02  0  0    3    2 2.337500 0.4278075
6              Valiant 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1 3.016667 0.3314917
7           Duster 360 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4 1.787500 0.5594406
8            Merc 240D 24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2 6.100000 0.1639344
9             Merc 230 22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2 5.700000 0.1754386
10            Merc 280 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4 3.200000 0.3125000
11           Merc 280C 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4 2.966667 0.3370787
12          Merc 450SE 16.4   8 275.8 180 3.07 4.070 17.40  0  0    3    3 2.050000 0.4878049
13          Merc 450SL 17.3   8 275.8 180 3.07 3.730 17.60  0  0    3    3 2.162500 0.4624277
14         Merc 450SLC 15.2   8 275.8 180 3.07 3.780 18.00  0  0    3    3 1.900000 0.5263158
15  Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4 1.300000 0.7692308
16 Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4 1.300000 0.7692308
17   Chrysler Imperial 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4 1.837500 0.5442177
18            Fiat 128 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1 8.100000 0.1234568
19         Honda Civic 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2 7.600000 0.1315789
20      Toyota Corolla 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1 8.475000 0.1179941
21       Toyota Corona 21.5   4 120.1  97 3.70 2.465 20.01  1  0    3    1 5.375000 0.1860465
22    Dodge Challenger 15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    2 1.937500 0.5161290
23         AMC Javelin 15.2   8 304.0 150 3.15 3.435 17.30  0  0    3    2 1.900000 0.5263158
24          Camaro Z28 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4 1.662500 0.6015038
25    Pontiac Firebird 19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    2 2.400000 0.4166667
26           Fiat X1-9 27.3   4  79.0  66 4.08 1.935 18.90  1  1    4    1 6.825000 0.1465201
27       Porsche 914-2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2 6.500000 0.1538462
28        Lotus Europa 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2 7.600000 0.1315789
29      Ford Pantera L 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4 1.975000 0.5063291
30        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6 3.283333 0.3045685
31       Maserati Bora 15.0   8 301.0 335 3.54 3.570 14.60  0  1    5    8 1.875000 0.5333333
32          Volvo 142E 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2 5.350000 0.1869159
#+end_src

** Compute new columns based on other columns and throw away all the old columns

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dplyr.R" :wrap "src text :eval never :tangle no"
dplyr::transmute(mtcarsR, mpc=mpg/cyl, mpd=mpg/disp)
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
        mpc        mpd
1  3.500000 0.13125000
2  3.500000 0.13125000
3  5.700000 0.21111111
4  3.566667 0.08294574
5  2.337500 0.05194444
6  3.016667 0.08044444
7  1.787500 0.03972222
8  6.100000 0.16632584
9  5.700000 0.16193182
10 3.200000 0.11455847
11 2.966667 0.10620525
12 2.050000 0.05946338
13 2.162500 0.06272661
14 1.900000 0.05511240
15 1.300000 0.02203390
16 1.300000 0.02260870
17 1.837500 0.03340909
18 8.100000 0.41168996
19 7.600000 0.40158520
20 8.475000 0.47679325
21 5.375000 0.17901749
22 1.937500 0.04874214
23 1.900000 0.05000000
24 1.662500 0.03800000
25 2.400000 0.04800000
26 6.825000 0.34556962
27 6.500000 0.21612635
28 7.600000 0.31966351
29 1.975000 0.04501425
30 3.283333 0.13586207
31 1.875000 0.04983389
32 5.350000 0.17685950
#+end_src

* Aggregation

