docs/dplyr.html

<div id="outline-container-orge5b3130" class="outline-2">
<h2 id="orge5b3130"><span class="section-number-2">7</span> Aggregation</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd4c2ff6" class="outline-3">
<h3 id="orgd4c2ff6"><span class="section-number-3">7.1</span> Global Aggregation</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-R">dplyr::summarize(mtcars, mean_disp=mean(disp), sd_disp=sd(disp), mean_wt=mean(wt))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">  mean_disp  sd_disp mean_wt
1  230.7219 123.9387 3.21725
</pre>
</div>
</div>
</div>

<div id="outline-container-org88d5857" class="outline-3">
<h3 id="org88d5857"><span class="section-number-3">7.2</span> Aggregate by factor level</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-R">dplyr::summarize(dplyr::group_by(mtcars, cyl), mean_disp_by_cyl=mean(disp), .groups = <span style="color: #fa8072;">'drop'</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text"># A tibble: 3 x 2
    cyl mean_disp_by_cyl
1     4             105.
2     6             183.
3     8             353.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgff6cd3f" class="outline-3">
<h3 id="orgff6cd3f"><span class="section-number-3">7.3</span> Aggregate by multiple factors</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-R">dplyr::summarize(dplyr::group_by(mtcars, cyl, gear), mean_disp_by_cyl_and_gear=mean(disp), .groups = <span style="color: #fa8072;">'drop'</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text"># A tibble: 8 x 3
    cyl  gear mean_disp_by_cyl_and_gear
1     4     3                      120.
2     4     4                      103.
3     4     5                      108.
4     6     3                      242.
5     6     4                      164.
6     6     5                      145 
7     8     3                      358.
8     8     5                      326
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb548ba6" class="outline-3">
<h3 id="orgb548ba6"><span class="section-number-3">7.4</span> Summarize by group and put results back in data frame</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-R">dplyr::mutate(dplyr::group_by(mtcars, cyl, gear), mean_disp_by_cyl_and_gear=mean(disp))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text"># A tibble: 32 x 12
# Groups:   cyl, gear [8]
     mpg   cyl  disp    hp  drat    wt  qsec    vs    am  gear  carb mean_disp_by_cyl_and_gear
 1  21       6 160     110  3.9   2.62  16.5     0     1     4     4                      164.
 2  21       6 160     110  3.9   2.88  17.0     0     1     4     4                      164.
 3  22.8     4 108      93  3.85  2.32  18.6     1     1     4     1                      103.
 4  21.4     6 258     110  3.08  3.22  19.4     1     0     3     1                      242.
 5  18.7     8 360     175  3.15  3.44  17.0     0     0     3     2                      358.
 6  18.1     6 225     105  2.76  3.46  20.2     1     0     3     1                      242.
 7  14.3     8 360     245  3.21  3.57  15.8     0     0     3     4                      358.
 8  24.4     4 147.     62  3.69  3.19  20       1     0     4     2                      103.
 9  22.8     4 141.     95  3.92  3.15  22.9     1     0     4     2                      103.
10  19.2     6 168.    123  3.92  3.44  18.3     1     0     4     4                      164.
11  17.8     6 168.    123  3.92  3.44  18.9     1     0     4     4                      164.
12  16.4     8 276.    180  3.07  4.07  17.4     0     0     3     3                      358.
13  17.3     8 276.    180  3.07  3.73  17.6     0     0     3     3                      358.
14  15.2     8 276.    180  3.07  3.78  18       0     0     3     3                      358.
15  10.4     8 472     205  2.93  5.25  18.0     0     0     3     4                      358.
16  10.4     8 460     215  3     5.42  17.8     0     0     3     4                      358.
17  14.7     8 440     230  3.23  5.34  17.4     0     0     3     4                      358.
18  32.4     4  78.7    66  4.08  2.2   19.5     1     1     4     1                      103.
19  30.4     4  75.7    52  4.93  1.62  18.5     1     1     4     2                      103.
20  33.9     4  71.1    65  4.22  1.84  19.9     1     1     4     1                      103.
21  21.5     4 120.     97  3.7   2.46  20.0     1     0     3     1                      120.
22  15.5     8 318     150  2.76  3.52  16.9     0     0     3     2                      358.
23  15.2     8 304     150  3.15  3.44  17.3     0     0     3     2                      358.
24  13.3     8 350     245  3.73  3.84  15.4     0     0     3     4                      358.
25  19.2     8 400     175  3.08  3.84  17.0     0     0     3     2                      358.
26  27.3     4  79      66  4.08  1.94  18.9     1     1     4     1                      103.
27  26       4 120.     91  4.43  2.14  16.7     0     1     5     2                      108.
28  30.4     4  95.1   113  3.77  1.51  16.9     1     1     5     2                      108.
29  15.8     8 351     264  4.22  3.17  14.5     0     1     5     4                      326 
30  19.7     6 145     175  3.62  2.77  15.5     0     1     5     6                      145 
31  15       8 301     335  3.54  3.57  14.6     0     1     5     8                      326 
32  21.4     4 121     109  4.11  2.78  18.6     1     1     4     2                      103.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd2c2b2f" class="outline-2">
<h2 id="orgd2c2b2f"><span class="section-number-2">8</span> Join</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org6ff735f" class="outline-3">
<h3 id="org6ff735f"><span class="section-number-3">8.1</span> Example Data For Joins</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-R">carSurvey <span style="color: #8470ff; font-weight: bold;">&lt;-</span> data.table::fread(header=T, text=<span style="color: #fa8072;">'</span>
<span style="color: #fa8072;">               car_name, GEARS, word</span>
<span style="color: #fa8072;">              Mazda RX4,     4, ZoomZoom</span>
<span style="color: #fa8072;">          Mazda RX4 Wag,     4, ZoomZoom</span>
<span style="color: #fa8072;">     Cadillac Fleetwood,     3, RollingCouch</span>
<span style="color: #fa8072;">    Lincoln Continental,     3, RollingCouch</span>
<span style="color: #fa8072;">               Delorean,    16, TimeWarp</span>
<span style="color: #fa8072;">          Porsche 914-2,     5, SuperCar</span>
<span style="color: #fa8072;">           Lotus Europa,     5, SuperCar</span>
<span style="color: #fa8072;">           Ferrari Dino,     5, SuperCar</span>
<span style="color: #fa8072;">           Ferrari Dino,     5, SuperRedCar</span>
<span style="color: #fa8072;">             Volvo 142E,     4, BoxeyButGood</span>
<span style="color: #fa8072;">   '</span>)
carSurvey
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">               car_name GEARS         word
 1:           Mazda RX4     4     ZoomZoom
 2:       Mazda RX4 Wag     4     ZoomZoom
 3:  Cadillac Fleetwood     3 RollingCouch
 4: Lincoln Continental     3 RollingCouch
 5:            Delorean    16     TimeWarp
 6:       Porsche 914-2     5     SuperCar
 7:        Lotus Europa     5     SuperCar
 8:        Ferrari Dino     5     SuperCar
 9:        Ferrari Dino     5  SuperRedCar
10:          Volvo 142E     4 BoxeyButGood
</pre>
</div>

<p>
Notes:
</p>
<ul class="org-ul">
<li>The '<code>gear</code>' column in <code>mtcars</code> and the '<code>GEARS</code>' column in <code>carSurvey</code> are logically the equivlant; however, they have different names!</li>
<li>The '<code>word</code>' column is not very descriptive outside of the <code>carSurvey</code> container.</li>
</ul>
</div>
</div>
