src/dplyr.org
** full outer Join

 Now we get a record for *every* record on the left (x) and right (y).  Any extra records that don't match the other side get =NA= values.

 #+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dplyr.R" :wrap "src text :eval never :tangle no"
 dplyr::full_join(mtcarsR, carSurvey, by=c('car_name', 'gear'='GEARS'));
 #+END_SRC

 #+RESULTS:
 #+begin_src text :eval never :tangle no
               car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb         word
 1            Mazda RX4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4     ZoomZoom
 2        Mazda RX4 Wag 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4     ZoomZoom
 3           Datsun 710 22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1         <NA>
 4       Hornet 4 Drive 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1         <NA>
 5    Hornet Sportabout 18.7   8 360.0 175 3.15 3.440 17.02  0  0    3    2         <NA>
 6              Valiant 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1         <NA>
 7           Duster 360 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4         <NA>
 8            Merc 240D 24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2         <NA>
 9             Merc 230 22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2         <NA>
 10            Merc 280 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4         <NA>
 11           Merc 280C 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4         <NA>
 12          Merc 450SE 16.4   8 275.8 180 3.07 4.070 17.40  0  0    3    3         <NA>
 13          Merc 450SL 17.3   8 275.8 180 3.07 3.730 17.60  0  0    3    3         <NA>
 14         Merc 450SLC 15.2   8 275.8 180 3.07 3.780 18.00  0  0    3    3         <NA>
 15  Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4 RollingCouch
 16 Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4 RollingCouch
 17   Chrysler Imperial 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4         <NA>
 18            Fiat 128 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1         <NA>
 19         Honda Civic 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2         <NA>
 20      Toyota Corolla 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1         <NA>
 21       Toyota Corona 21.5   4 120.1  97 3.70 2.465 20.01  1  0    3    1         <NA>
 22    Dodge Challenger 15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    2         <NA>
 23         AMC Javelin 15.2   8 304.0 150 3.15 3.435 17.30  0  0    3    2         <NA>
 24          Camaro Z28 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4         <NA>
 25    Pontiac Firebird 19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    2         <NA>
 26           Fiat X1-9 27.3   4  79.0  66 4.08 1.935 18.90  1  1    4    1         <NA>
 27       Porsche 914-2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2     SuperCar
 28        Lotus Europa 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2     SuperCar
 29      Ford Pantera L 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4         <NA>
 30        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6     SuperCar
 31        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6  SuperRedCar
 32       Maserati Bora 15.0   8 301.0 335 3.54 3.570 14.60  0  1    5    8         <NA>
 33          Volvo 142E 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2 BoxeyButGood
 34            Delorean   NA  NA    NA  NA   NA    NA    NA NA NA   16   NA     TimeWarp
 #+end_src

** Find left matches

 Sometimes you just want to filter a table by keeping only records that match some other table.  Note =semi_join= is not just a =left_join= followed by the
 removal of the right columns: 1) The column titles are from the left side only, and 2) records are not duplicated when multiple matches exist on the right.

 #+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dplyr.R" :wrap "src text :eval never :tangle no"
 dplyr::semi_join(mtcarsR, carSurvey, by=c('car_name', 'gear'='GEARS'));
 #+END_SRC

 #+RESULTS:
 #+begin_src text :eval never :tangle no
              car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb
 1           Mazda RX4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4
 2       Mazda RX4 Wag 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4
 3  Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4
 4 Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4
 5       Porsche 914-2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2
 6        Lotus Europa 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2
 7        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6
 8          Volvo 142E 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2
 #+end_src

** Fixing column names

 #+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dplyr.R" :wrap "src text :eval never :tangle no"
 dplyr::inner_join(mtcarsR, rename(carSurvey, gear=GEARS, survey_word=word), by=c('car_name', 'gear'));
 #+END_SRC

 #+RESULTS:
 #+begin_src text :eval never :tangle no
              car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb  survey_word
 1           Mazda RX4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4     ZoomZoom
 2       Mazda RX4 Wag 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4     ZoomZoom
 3  Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4 RollingCouch
 4 Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4 RollingCouch
 5       Porsche 914-2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2     SuperCar
 6        Lotus Europa 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2     SuperCar
 7        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6     SuperCar
 8        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6  SuperRedCar
 9          Volvo 142E 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2 BoxeyButGood
 #+end_src

* Chaining vs Nesting

** Chaining

Chaining is a technique using the %>% operator that can be used to "chain" together dplyr calls into sequential steps.  The idea is very much like how pipes
are used on the UNIX command line.

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dplyr.R" :wrap "src text :eval never :tangle no"
mtcarsR %>%
  dplyr::group_by(cyl, carb) %>%
  dplyr::select(mpg, hp, cyl, carb) %>%
  dplyr::summarise(meanMPG=mean(mpg, na.rm=TRUE),
                   meanCYL=mean(hp,  na.rm=TRUE),
                   .groups = 'drop')  %>%
  filter(meanMPG > 20)
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
# A tibble: 2 x 4
    cyl  carb meanMPG meanCYL
1     4     1    27.6    77.4
2     4     2    25.9    87
#+end_src

