docs/dplyr.html

<div id="outline-container-org266ca97" class="outline-3">
<h3 id="org266ca97"><span class="section-number-3">8.5</span> full outer Join</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Now we get a record for <b>every</b> record on the left (x) and right (y).  Any extra records that don't match the other side get <code>NA</code> values.
</p>

<div class="org-src-container">
<pre class="src src-R">dplyr::full_join(mtcarsR, carSurvey, by=c(<span style="color: #fa8072;">'car_name'</span>, <span style="color: #fa8072;">'gear'</span>=<span style="color: #fa8072;">'GEARS'</span>));
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">              car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb         word
1            Mazda RX4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4     ZoomZoom
2        Mazda RX4 Wag 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4     ZoomZoom
3           Datsun 710 22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1         &lt;NA&gt;
4       Hornet 4 Drive 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1         &lt;NA&gt;
5    Hornet Sportabout 18.7   8 360.0 175 3.15 3.440 17.02  0  0    3    2         &lt;NA&gt;
6              Valiant 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1         &lt;NA&gt;
7           Duster 360 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4         &lt;NA&gt;
8            Merc 240D 24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2         &lt;NA&gt;
9             Merc 230 22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2         &lt;NA&gt;
10            Merc 280 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4         &lt;NA&gt;
11           Merc 280C 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4         &lt;NA&gt;
12          Merc 450SE 16.4   8 275.8 180 3.07 4.070 17.40  0  0    3    3         &lt;NA&gt;
13          Merc 450SL 17.3   8 275.8 180 3.07 3.730 17.60  0  0    3    3         &lt;NA&gt;
14         Merc 450SLC 15.2   8 275.8 180 3.07 3.780 18.00  0  0    3    3         &lt;NA&gt;
15  Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4 RollingCouch
16 Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4 RollingCouch
17   Chrysler Imperial 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4         &lt;NA&gt;
18            Fiat 128 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1         &lt;NA&gt;
19         Honda Civic 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2         &lt;NA&gt;
20      Toyota Corolla 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1         &lt;NA&gt;
21       Toyota Corona 21.5   4 120.1  97 3.70 2.465 20.01  1  0    3    1         &lt;NA&gt;
22    Dodge Challenger 15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    2         &lt;NA&gt;
23         AMC Javelin 15.2   8 304.0 150 3.15 3.435 17.30  0  0    3    2         &lt;NA&gt;
24          Camaro Z28 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4         &lt;NA&gt;
25    Pontiac Firebird 19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    2         &lt;NA&gt;
26           Fiat X1-9 27.3   4  79.0  66 4.08 1.935 18.90  1  1    4    1         &lt;NA&gt;
27       Porsche 914-2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2     SuperCar
28        Lotus Europa 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2     SuperCar
29      Ford Pantera L 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4         &lt;NA&gt;
30        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6     SuperCar
31        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6  SuperRedCar
32       Maserati Bora 15.0   8 301.0 335 3.54 3.570 14.60  0  1    5    8         &lt;NA&gt;
33          Volvo 142E 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2 BoxeyButGood
34            Delorean   NA  NA    NA  NA   NA    NA    NA NA NA   16   NA     TimeWarp
</pre>
</div>
</div>
</div>

<div id="outline-container-org423206d" class="outline-3">
<h3 id="org423206d"><span class="section-number-3">8.6</span> Find left matches</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Sometimes you just want to filter a table by keeping only records that match some other table.  Note <code>semi_join</code> is not just a <code>left_join</code> followed by the
removal of the right columns: 1) The column titles are from the left side only, and 2) records are not duplicated when multiple matches exist on the right.
</p>

<div class="org-src-container">
<pre class="src src-R">dplyr::semi_join(mtcarsR, carSurvey, by=c(<span style="color: #fa8072;">'car_name'</span>, <span style="color: #fa8072;">'gear'</span>=<span style="color: #fa8072;">'GEARS'</span>));
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">             car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb
1           Mazda RX4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4
2       Mazda RX4 Wag 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4
3  Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4
4 Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4
5       Porsche 914-2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2
6        Lotus Europa 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2
7        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6
8          Volvo 142E 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2
</pre>
</div>
</div>
</div>

<div id="outline-container-orgca6d781" class="outline-3">
<h3 id="orgca6d781"><span class="section-number-3">8.7</span> Fixing column names</h3>
<div class="outline-text-3" id="text-8-7">
<div class="org-src-container">
<pre class="src src-R">dplyr::inner_join(mtcarsR, rename(carSurvey, gear=GEARS, survey_word=word), by=c(<span style="color: #fa8072;">'car_name'</span>, <span style="color: #fa8072;">'gear'</span>));
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">             car_name  mpg cyl  disp  hp drat    wt  qsec vs am gear carb  survey_word
1           Mazda RX4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4     ZoomZoom
2       Mazda RX4 Wag 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4     ZoomZoom
3  Cadillac Fleetwood 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4 RollingCouch
4 Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4 RollingCouch
5       Porsche 914-2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2     SuperCar
6        Lotus Europa 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2     SuperCar
7        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6     SuperCar
8        Ferrari Dino 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6  SuperRedCar
9          Volvo 142E 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2 BoxeyButGood
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org71c7299" class="outline-2">
<h2 id="org71c7299"><span class="section-number-2">9</span> Chaining vs Nesting</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org0416d3a" class="outline-3">
<h3 id="org0416d3a"><span class="section-number-3">9.1</span> Chaining</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Chaining is a technique using the %&gt;% operator that can be used to "chain" together dplyr calls into sequential steps.  The idea is very much like how pipes
are used on the UNIX command line.
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsR <span style="color: #8470ff; font-weight: bold;">%&gt;%</span>
  dplyr::group_by(cyl, carb) <span style="color: #8470ff; font-weight: bold;">%&gt;%</span>
  dplyr::select(mpg, hp, cyl, carb) <span style="color: #8470ff; font-weight: bold;">%&gt;%</span>
  dplyr::summarise(meanMPG=mean(mpg, na.rm=<span style="color: #63b8ff;">TRUE</span>),
                   meanCYL=mean(hp,  na.rm=<span style="color: #63b8ff;">TRUE</span>),
                   .groups = <span style="color: #fa8072;">'drop'</span>)  <span style="color: #8470ff; font-weight: bold;">%&gt;%</span>
  filter(meanMPG &gt; 20)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text"># A tibble: 2 x 4
    cyl  carb meanMPG meanCYL
1     4     1    27.6    77.4
2     4     2    25.9    87
</pre>
</div>
</div>
</div>
